package Day09;

public class Day09_1 {
	
	// 1. 3 [ ÇÏ³ªÀÇ Å¬·¡½º·Î ¿©·¡°³ °´Ã¼ »ı¼º °¡´É ]
	// 2. 4 [ ·ÎÄÃº¯¼ö { } ³»¿¡¼­ ¼±¾ğ ]
	// 3. 4 [ ¹İµå½Ã´Â x ]
	// 4. 3 [ Å¬·¡½ºÀÇ ¸â¹ö ¼±¾ğ ¼ø¼­ x ]
	// 5. 1 
		// 1. °´Ã¼´Â »ı¼ºÀÚ x ÀÎ½ºÅÏ½º »ı¼ºÀÚo
		// 2. // this.¸â¹ö¸í
		//	this.ÇÊµå¸í
		//  this.¸Ş¼Òµå¿µ
		// 	this() : ºó »ı¼ºÀÚ È£Ãâ
		// this( µ¥ÀÌÅÍ, µ¥ÀÌÅÍ ) : »ı¼ºÀÚ
	// 6. void : ¸Ş¼Òµå°¡ Á¾·áµÇ¸é¼­ ¹İÈ¯°ªÀÌ ¾ø´Ù!
		// 4. Override : µ¿ÀÏÇÑ ¸Ş¼Òµå¸¦ ÀçÁ¤ÀÇ
	// 7. 2
	// 8. 2 static : Á¤Àû ¸â¹ö
		// °´Ã¼¾øÀÌ Å¬·¡½º¸¦ ÅëÇØ Á¢±Ù °¡´É <---------> new °´Ã¼·Î Á¢±Ù
	// 9. 2 final : »ó¼ö [ ¼öÁ¤ ºÒ°¡ ]
	// 10. 4 [ ´Ü ÀÌÅ¬¸³½º, ÀÎÅÚ¸®Á¦ÀÌ °°Àº ¿¡µğÅÍ´Â ÀÚµ¿º¯°æ ]
	// 11. 3 default : ÇØ´ç ÆĞÅ°Áö / private : ÇØ´ç Å¬·¡½º
	// 12. (1) ÇÊµå (2) »ı¼ºÀÚ (3) ¸Ş¼Òµå
			// {} ÀÖÀ¸¸é »ı¼ºÀÚ È¤Àº ¸Ş¼Òµå
			// Å¬·¡½º¸í°ú ÀÌ¸§ÀÌ µ¿ÀÏÇÏ¸é »ı¼ºÀÚ
			// Å¬·¡½º¸í°ú ÀÌ¸§ÀÌ µ¿ÀÏÇÏÁö ¾ÊÀ¸¸é ¸Ş¼Òµå
	// 13. 
		/*
		 *  String name;
		 * 	String id;
		 * 	String password;
		 *  int age;
		 */
	
	// 14. 
		/* »ı¼ºÀÚ ¼±¾ğ½Å : Å¬·¡½º ÀÌ¸§ µ¿ÀÏ
		 * Member ( String name , String id ) {
		 * 	this.name = name;
		 * 	this.id= id; 
		 * }
		 */
	
	// 15.
		/*	¸Å°³º¯¼ö : ÀÎ¼ö : ¸Ş¼Òµå È£­±â ¸Ş¼Òµå·Î µé¾î¿À´Â µ¥ÀÌÅÍ
		 * boolean login( String id, String password) {
		 *  *** ·Î±×ÀÎ ¸Ş¼Òµå
		 * if ( id.equals("hong") && password.equals("12345"){
		 * 		// ¾ÆÀÌµğ°¡ hong ÀÌ¸é¼­ ÆĞ½º¿Íµå°¡ 12345 ÀÌ¸é true ¹İÈ¯
		 * 		return true;
		 * }
		 * return false;
		 * }
		 * *** ·Î±×¾Æ¿ô¸Ş¼Òµå [ ¹İÈ¯Å¸ÀÔ ¸Ş¼Òµå¸í (ÀÎ¼ö1, ÀÎ¼ö2 ) { } ]
		 * void logout( String id ) {
		 * 
		 * System.out.print("·Î±×¾Æ¿ô µÇ¾ú½À´Ï´Ù.");
		 * 
		 * }
		 */
	// 16. **** µ¿ÀÏÇÑ ÀÌ¸§À¸·Î ¸Ş¼Òµå¸¦ ¼±¾ğ°¡´É [ ´Ü ¼­·Î ´Ù¸¥ ÀÎ¼ö[¸Å°³º¯¼ö] »ç¿ë ]
		/*	void println ( int x ) {	// ¿ÜºÎ·ÎºÎÅÍ intÇü º¯¼ö¸¦ ÀÎ¼ö·Î ¹Ş¾Æ Ãâ·Â ¸Ş¼Òµå
		 * 		System.out.println(x);
		 * }
		 * 	void println ( boolean x ) {	// ¿ÜºÎ·ÎºÎÅÍ intÇü º¯¼ö¸¦ ÀÎ¼ö·Î ¹Ş¾Æ Ãâ·Â ¸Ş¼Òµå
		 * 		System.out.println(x);
		 * }
		 * 	void println ( double x ) {	// ¿ÜºÎ·ÎºÎÅÍ intÇü º¯¼ö¸¦ ÀÎ¼ö·Î ¹Ş¾Æ Ãâ·Â ¸Ş¼Òµå
		 * 		System.out.println(x);
		 * }
		 * 	void println ( String x ) {	// ¿ÜºÎ·ÎºÎÅÍ intÇü º¯¼ö¸¦ ÀÎ¼ö·Î ¹Ş¾Æ Ãâ·Â ¸Ş¼Òµå
		 * 		System.out.println(x);
		 * }
		 */
	// 17. **** °´Ã¼¸¦ »ı¼ºÇÏÁö¾Ê°í ¸Ş¼Òµå¸¦ È£ÃâÇÏ´Â ¹æ¹ı
		/*	static println ( int x ) {	// ¿ÜºÎ·ÎºÎÅÍ intÇü º¯¼ö¸¦ ÀÎ¼ö·Î ¹Ş¾Æ Ãâ·Â ¸Ş¼Òµå
		 * 		System.out.println(x);
		 * }
		 * 	static println ( boolean x ) {	// ¿ÜºÎ·ÎºÎÅÍ intÇü º¯¼ö¸¦ ÀÎ¼ö·Î ¹Ş¾Æ Ãâ·Â ¸Ş¼Òµå
		 * 		System.out.println(x);
		 * }
		 * 	static println ( double x ) {	// ¿ÜºÎ·ÎºÎÅÍ intÇü º¯¼ö¸¦ ÀÎ¼ö·Î ¹Ş¾Æ Ãâ·Â ¸Ş¼Òµå
		 * 		System.out.println(x);
		 * }
		 * 	static println ( String x ) {	// ¿ÜºÎ·ÎºÎÅÍ intÇü º¯¼ö¸¦ ÀÎ¼ö·Î ¹Ş¾Æ Ãâ·Â ¸Ş¼Òµå
		 * 		System.out.println(x);
		 * }
		 */
	
	
}
